---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReinforcementWarn
source: html/186f1fea-c3b6-705c-1ace-d3e761db86bd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReinforcementWarn Property

Can't find a host for Area Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceAreaReinforcementWarn { get; }
```